In [6]:
================== Data Analysis ====================
1. Pandas              : Data frame analysis
2. Numpy               : Numerical analysis
3. matplotlib          : Graphs and plots
4. seaborn             : plots
5. Bokhe               : plots
6. plotly              : plots


================== Machine Learning =================
7. stats                 : for statistical models
8. scikit-learn(sklearn) : ML models

=================== Deep learning ======================
9.  opencv             : Computer vision
10. pillow             : Image operations
11. tensorflow         : Neural Network creations (developed by google)
12. keras              : NN
13. pytorch            : alternative package of tensorflow (facebook meta)

====================== NLP ==============================
14. NLKT               : Natural language toolkit
15. Spacy              : Alternative to NLKT
16. wordcloud          : most frequent occured words
=================== Scrapping ==================================
17. SqLite              : Data base creation
18. Beautiful soup
19. Selenium

============================= API creations ==============
20. Flask
21. FastAPI
22. Gradio
23. Django

============================ UI app creation ================
24. Streamlit

======================== Transfer learning models (DL) ================
25. Mobilenet
26. Resnet
27. VGGnet
28. Inception
29. Yolo             : Ultralytics

====================== Transfer learning models (NLP) =========================
30. Word2vec
31. GloVe

========================== Huging Face Transformers =====================
32. BERT          : Bi Directional Encoder representation of Transformers

============================== Allen NLP =============================
33. Allen NLP Packages

================================ GenAI =========================
34. LangChain
35. Google GeminiAi related packages
36. OpenAI GPT related packages
37. Amazon BedRock related Packages
38. Meta Llama related packages
    
====================== Image and Video Generations ================
39. GAN models related packages
40. SORA related packages

============================ Model deployment (MlOps) =========================
41. mlflow using databricks
42. kubeflow (GCP account)

============================ Cloud applications =======================
43. Azure ML related packages
44. GCP VertexAI related packages
45. AWS Sagemaker related packages

========================== small ===========================
46. time
47. logging
48. math
49. random
50. env
51. os

SyntaxError: invalid non-printable character U+00A0 (214393106.py, line 12)

**Step-1 import Packages**

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**Step-2 Create a Dataframe using list**

- data:your data either list or dict
- list:we need to provide a list
- columns:we need to provide a list

In [8]:
import pandas as pd
names=['ramesh','suresh','satish']
pd.DataFrame(names,columns=['Names'])

    Names
0  ramesh
1  suresh
2  satish

**Step-3 Change the index**

In [9]:
import pandas as pd
names=['ramesh','suresh','satish']
pd.DataFrame(names,index=['A','B','C'],columns=['Names'])

    Names
A  ramesh
B  suresh
C  satish

**Step-4 add multiple lines**

In [10]:
import pandas as pd
names=['ramesh','suresh','satish']
age=[22,21,24]
pd.DataFrame(zip(names,age),index=['A','B','C'],columns=['Names','Age'])

    Names  Age
A  ramesh   22
B  suresh   21
C  satish   24

**Step-5 Create empty dataframe and update the columns**

In [11]:
import pandas as pd
df=pd.DataFrame()
df['Names']=['ramesh','suresh','satish']
df['Age']=[22,21,24]
df

    Names  Age
0  ramesh   22
1  suresh   21
2  satish   24

**Step-6 Add a newcolums with existing dataframe**

In [12]:
import pandas as pd
df['Names']=['ramesh','suresh','satish']
df['Age']=[22,21,24]
df=pd.DataFrame(zip(names,age),columns=['Names','Age'])
df['city']=['hyd','gnt','nrt']
df

    Names  Age city
0  ramesh   22  hyd
1  suresh   21  gnt
2  satish   24  nrt

**Step-7 overwrite the column values**

- i want to overwrite my age values
- orginally age is =[22,21,24]
- now i want to update the age =[24,25,26]

In [13]:
df['Age']=[22,21,24]
df['age']=[24,25,26]
df

    Names  Age city  age
0  ramesh   22  hyd   24
1  suresh   21  gnt   25
2  satish   24  nrt   26

**Step-8 Drop the columns**

- lables
- axis
- index
- columns
- inplace

In [14]:
df

    Names  Age city  age
0  ramesh   22  hyd   24
1  suresh   21  gnt   25
2  satish   24  nrt   26

In [15]:
df.drop('age') #error
df.drop('age',axis=0) #error
df.drop('age',axis=1) # correct
# here python assume age is a label
# python ask question : is it index label or column label
# axis=1 means for columns
# axis=0 means for rows
# by default axis=0

KeyError: "['age'] not found in axis"

In [ ]:
df.drop('age',axis=1)

In [ ]:
df # we are able to see old column
# because we didnot apply inplace=True

In [ ]:
# whenever we see column labels
# no need of axis
df.drop(columns=['age'],inplace=True)

In [ ]:
df

In [ ]:
# drop index=2
df.drop(2,axis=0)

In [ ]:
df.drop(index=2)

**Step-9:rename the column**

**Session-2**

In [16]:
mapper: it is nothing but dictionary
index:
columns:{'City'
axis:
copy:
inplace:

SyntaxError: invalid syntax (2710181638.py, line 1)

In [17]:
import pandas as pd
df=pd.DataFrame()
df['Names']=['ramesh','suresh','satish']
df['Age']=[22,21,24]
df['city']=['hyd','gnt','nrt']
df

    Names  Age city
0  ramesh   22  hyd
1  suresh   21  gnt
2  satish   24  nrt

In [18]:
dict1={'City':'city'}
df.rename(columns=dict1,
          inplace=True)
df

    Names  Age city
0  ramesh   22  hyd
1  suresh   21  gnt
2  satish   24  nrt

In [19]:
dict1={'city':'City'}
df.rename(dict1)

    Names  Age city
0  ramesh   22  hyd
1  suresh   21  gnt
2  satish   24  nrt

In [20]:
dict1={2:'B'}
df.rename(dict1,axis=0)

    Names  Age city
0  ramesh   22  hyd
1  suresh   21  gnt
B  satish   24  nrt

In [21]:
dict1={2:'B'}
df.rename(index=dict1)

    Names  Age city
0  ramesh   22  hyd
1  suresh   21  gnt
B  satish   24  nrt

In [22]:
df1=pd.DataFrame()
df1['value']=[i for i in range(1,10)]
df1['square_value']=[i*i for i in range(1,10)]
df1['cube_value']=[i*i*i for i in range(1,10)]
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

- len

- columns

- shape

- dtypes

- head

- tail

In [23]:
df1.columns

Index(['value', 'square_value', 'cube_value'], dtype='object')

In [24]:
list(df1.columns)

['value', 'square_value', 'cube_value']

In [25]:
df1.columns.to_list()

['value', 'square_value', 'cube_value']

In [26]:
df1.shape

(9, 3)

In [39]:
df1.tail()

   value  square_value  cube_value
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [40]:
df1.head()

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125

In [41]:
df1.dtypes
#integer we will get integer
# float we will get float
# string we will get object

value           int64
square_value    int64
cube_value      int64
dtype: object

In [42]:
df.dtypes

Names    object
Age       int64
city     object
dtype: object

In [43]:
df1.isnull()
# we are asking a question
# a null value available or not
# True or False
# True means yes NULL vailable
# False means No NULL value not available

   value  square_value  cube_value
0  False         False       False
1  False         False       False
2  False         False       False
3  False         False       False
4  False         False       False
5  False         False       False
6  False         False       False
7  False         False       False
8  False         False       False

In [44]:
df1.isnull().sum()
# column wise null value count will diaplay

value           0
square_value    0
cube_value      0
dtype: int64

In [45]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   value         9 non-null      int64
 1   square_value  9 non-null      int64
 2   cube_value    9 non-null      int64
dtypes: int64(3)
memory usage: 348.0 bytes

**Step-10**

- How to change a specific value of a colums

- df1.drop
     - either it willdrop column or index
- df1.rename
      - either it will rename column or index

In [34]:
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [35]:
df1.replace({64:464,1:111}) # all the data will replace

   value  square_value  cube_value
0    111           111         111
1      2             4           8
2      3             9          27
3      4            16         464
4      5            25         125
5      6            36         216
6      7            49         343
7      8           464         512
8      9            81         729

**Step-11: Selection of a column**

In [36]:
df1['cube_value']
# series
# series looks like dataframe
# but no rows
# series is always a one dimensional data.

0      1
1      8
2     27
3     64
4    125
5    216
6    343
7    512
8    729
Name: cube_value, dtype: int64

In [46]:
type(df1['cube_value'])

pandas.core.series.Series

In [47]:
df1['cube_value'].shape

(9,)

In [48]:
df1.shape # 2D

(9, 3)

In [49]:
df1[['cube_value']]

   cube_value
0           1
1           8
2          27
3          64
4         125
5         216
6         343
7         512
8         729

In [50]:
type(df1)

pandas.core.frame.DataFrame

In [51]:
df1[['cube_value','square_value']]

   cube_value  square_value
0           1             1
1           8             4
2          27             9
3          64            16
4         125            25
5         216            36
6         343            49
7         512            64
8         729            81

**step-12:How to append a row**

- loc
- iloc

In [52]:
# df1.loc[rows,columns]
# df1.iloc[rows,columns]
# we can select particular rows and columns using a list:[start:stop:step]
import pandas as pd
df1=pd.DataFrame()
df1['value']=[i for i in range(1,10)]
df1['square_value']=[i*i for i in range(1,10)]
df1['cube_value']=[i*i*i for i in range(1,10)]
df1
df1.iloc[3:7,1:3]
df1.loc[3:7,['square_value','cube_value']]
cols=['square_value','cube_value']
df1.loc[3:7,cols]

   square_value  cube_value
3            16          64
4            25         125
5            36         216
6            49         343
7            64         512

In [71]:
cols=['square_value','cube_value']
df1.loc[3:7,cols]

   square_value  cube_value
3            16          64
4            25         125
5            36         216
6            49         343
7            64         512

In [72]:
df1.iloc[3:7,1:3]
df1.loc[3:7,['square_value','cube_value']]

   square_value  cube_value
3            16          64
4            25         125
5            36         216
6            49         343
7            64         512

In [53]:
df1.iloc[[2,3,4]]
df1.iloc[[2]]
df1.iloc[2]
df1.iloc[[2,3,4],[0,2]]
df1.iloc[2,0]
df1.iloc[:,0]
df1.iloc[2,:]
df1.iloc[[2],:]
df1.iloc[2:6,0]
df1.iloc[2:6,[0]]
df1.iloc[[2,3,4]]
# selecting 3 rows,all the columns
# dataframe

   value  square_value  cube_value
2      3             9          27
3      4            16          64
4      5            25         125

In [54]:
df1.iloc[[2]] #2D df

   value  square_value  cube_value
2      3             9          27

In [55]:
df1.iloc[2] # 1D series

value            3
square_value     9
cube_value      27
Name: 2, dtype: int64

In [56]:
df1.iloc[[2,3,4],[0,2]]
# 2,3,4 row
# 0 and 2nd index (1,3)

   value  cube_value
2      3          27
3      4          64
4      5         125

In [58]:
df1.iloc[2,0]

np.int64(3)

In [59]:
df1
# in column1 (value) i want to replace value to 60
# based on specific index
df1.iloc[5,0]

np.int64(6)

In [60]:
df1.iloc[:,0]
# rows and first column

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: value, dtype: int64

In [61]:
df1.iloc[2,:]

value            3
square_value     9
cube_value      27
Name: 2, dtype: int64

In [62]:
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [63]:
df1.iloc[[2],:]

   value  square_value  cube_value
2      3             9          27

In [64]:
df1.iloc[2:6,0]

2    3
3    4
4    5
5    6
Name: value, dtype: int64

In [65]:
df1.iloc[2:6,[0]]

   value
2      3
3      4
4      5
5      6

**how to append a row**

In [66]:
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [70]:
df1.loc[9]=[10,100,1000]

In [68]:
len(df1)

10

In [69]:
ID=len(df1)
df1.loc[ID]=[10,100,1000]
df1

    value  square_value  cube_value
0       1             1           1
1       2             4           8
2       3             9          27
3       4            16          64
4       5            25         125
5       6            36         216
6       7            49         343
7       8            64         512
8       9            81         729
9      10           100        1000
10     10           100        1000

**Step-13:Save the dataframe**

- we can save dataframes intwo ways
- .csv
- .xlsx
- where i want to save:directory
- what the filename to save:filename
- what the type of a file:extension
- different folder:r"c:\users\jagar\OneDrive\Documents\Gen_AI\data1.csv"
- different folder:r"c:\users\jagar\OneDrive\Documents\Gen_AI\data1.xlsx"
- same folder:r"data1.csv" or r"data1.xlsx"

In [73]:
csv_path=r"c:\users\jagar\OneDrive\Documents\Gen_AI\data1.csv"
excel_path=r"c:\users\jagar\OneDrive\Documents\Gen_AI\data1.xlsx"
df1.to_csv(csv_path) # index column created extra
df1.to_excel(excel_path) # index column created extra

OSError: Cannot save file into a non-existent directory: 'c:\users\jagar\OneDrive\Documents\Gen_AI'

In [74]:
csv_path=r"data1.csv"
excel_path=r"data1.xlsx"
df1.to_csv(csv_path) # index column created extra
df1.to_excel(excel_path) #n index column created extra

**Step-14:read the data**

In [75]:
csv_path=r"C:\Users\jagar\Documents\cool.csv"
pd.read_csv(csv_path)

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [76]:
excel_path=r"c:\Users\jagar\Documents\Silent.xlsx"
pd.read_excel(excel_path)

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [77]:
import pandas as pd
df1=pd.DataFrame()
df1['value']=[i for i in range(1,10)]
df1['square_value']=[i*i for i in range(1,10)]
df1['cube_value']=[i*i*i for i in range(1,10)]
df1
df1.iloc[3:7,1:3]
df1.loc[3:7,['square_value','cube_value']]
cols=['square_value','cube_value']
df1.loc[3:7,cols]
csv_path=r"C:\Users\jagar\Documents\cool.csv"
excel_path=r"C:\Users\jagar\Documents\Silent.xlsx"
df1.to_csv(csv_path,index=False) # index column created extra
df1.to_excel(excel_path,index=False) # index column created extra
df1

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [78]:
csv_path=r"C:\Users\jagar\Documents\cool.csv"
pd.read_csv(csv_path)

   value  square_value  cube_value
0      1             1           1
1      2             4           8
2      3             9          27
3      4            16          64
4      5            25         125
5      6            36         216
6      7            49         343
7      8            64         512
8      9            81         729

In [79]:
import pandas as pd
csv_path=r"C:\Users\jagar\Documents\bank.csv"
pd.read_csv(csv_path)

     age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0     30;"unemployed";"married";"primary";"no";1787;...
1     33;"services";"married";"secondary";"no";4789;...
2     35;"management";"single";"tertiary";"no";1350;...
3     30;"management";"married";"tertiary";"no";1476...
4     59;"blue-collar";"married";"secondary";"no";0;...
...                                                 ...
4516  33;"services";"married";"secondary";"no";-333;...
4517  57;"self-employed";"married";"tertiary";"yes";...
4518  57;"technician";"married";"secondary";"no";295...
4519  28;"blue-collar";"married";"secondary";"no";11...
4520  44;"entrepreneur";"single";"tertiary";"no";113...

[4521 rows x 1 columns]

In [80]:
import pandas as pd
csv_path=r"C:\Users\jagar\Documents\Visadataset.csv"
pd.read_csv(csv_path)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [1]:
import numpy as np

# Creating arrays
arr = np.array([1, 2, 3, 4, 5])

# Vectorized operation (no loop)
squared = arr ** 2  
print(squared)  # [ 1  4  9 16 25 ]

# Matrix multiplication
A = np.array([[1, 2], [3, 4]])
B = np.array([[5, 6], [7, 8]])
print(np.dot(A, B))

[ 1  4  9 16 25]
[[19 22]
 [43 50]]